/* REXX */

say " "
say "Meu Segundo Programa em REXX!"
say "Digite dois numeros:"
parse pull a b

say "Voce digitou:" a "e" b

say a "+" b "=" a + b
say a "-" b "=" a - b
say a "*" b "=" a * b
say a "/" b "=" a / b

say a "dividido por" b "e" a % b "resto" a // b